[	
	{
    "number": "1",
    "episodes": [
      { 
         "number": "1",
         "name": "(Pilot)",
         "description": "<p>PATRICIA HEATON stars as Frankie Heck, a dedicated wife and mother who juggles work, family and life in an everyday, average American town. Frankie and Mike (series star NEIL FLYNN) are both working parents desperately trying on a daily basis to discipline their teenage son, Axl (series star CHARLIE MCDERMOTT), support their untalented-yet-severely-optimistic daughter, Sue (series star EDEN SHER), and attend parent-teacher meetings to discuss their oddball youngest son, Brick (series star ATTICUS SHAFFER). Life may seem average in the middle of America but it's anything but for Frankie Heck and her family.</p>  <p>In the premiere episode, Frankie is struggling in her career as a car salesperson because she has failed to actually sell a car. Sue has auditioned for show choir and, to everyone's shock, makes the team, but fails to mention that she's part of the stage crew. To top things off, Brick wants Frankie to come to his class presentation dressed as a superhero. Just when Frankie thinks she's got a car sold and her kids under control, she does show up to Brick's class dressed as a superhero – but he's given her the wrong day – and the car she thought she had sold is stolen right in front of her. Work and home have taken over Frankie's life... to the point that she barely recognizes herself and has even taken to coloring her hair with a magic marker. Her youth has faded and the day-to-day grind has worn her down, but it's family and the struggles they face together that keep Frankie and the rest of the Hecks one big happy mess.</p>"
      },
      { 
         "number": "2",
         "name": "The Cheerleader",
         "description": "<p>Facing financial disaster, Frankie tries to save her job by organizing a publicity stunt involving a car filled with jelly beans; Sue fails swim team tryouts, and then learns she needs glasses; and when Brick can't check books out of the library because Frankie can't pay a $200 library fine, he starts reading his mother's steamy romance novels.</p>"
      },
      { 
         "number": "3",
         "name": "The Floating Anniversary",
         "description": "<p>Frankie and Mike's romantic plans for their anniversary are thwarted by a sick Brick, a lovesick Sue, a learner's permit-toting Axl, two crazy aunts and their diaper-wearing dog.</p>"
      },
      { 
         "number": "4",
         "name": "The Trip",
         "description": "<p>Meek daughter Sue finally succeeds in doing something right by selling thousands of dollars' worth of sausage and cheese samples for the school, which makes her eligible to travel to the state capitol. But when the school fails to recognize her achievement, Frankie urges her daughter to fight for her right to collect her well-deserved prize. Meanwhile, Brick discovers that love isn't all it's cracked up to be when his first girlfriend proves to be a bit on the bossy side.</p>"
      },
      { 
         "number": "5",
         "name": "The Block Party",
         "description": "<p>Brick's teachers tell Frankie and Mike that Brick tested as 'socially challenged' – so Mike thinks basketball is the answer to help Brick interact with others. When that fails, Mike enters the neighborhood block-party lawnmower contest and discovers that Brick has a talent for souping up machines. Meanwhile Frankie joins the booster club to raise money for new football jerseys for Axl's team – but Axl refuses to give his old one to her.</p>"
      },
      { 
         "number": "6",
         "name": "The Front Door",
         "description": "<p>Frankie is caught in the middle when Axl accidentally breaks down the front door, and Mike insists that he fix it – which could leave the Heck house wide open for days.  Meanwhile, Frankie must sell a car within a week or be forced to wear a dog suit outside the lot.  And it's school picture time for Sue, who has never had a flattering photo taken of her.</p>"
      },
      { 
         "number": "7",
         "name": "The Scratch",
         "description": "<p>When the Heck family goes into a cleaning frenzy in order to get the trash out to a passing garbage truck, Frankie accidentally hits Brick with a beer bottle as she attempts to toss it into a bag - causing a small scratch. But when Brick innocently informs his school that his scratch was caused by his mother throwing a beer bottle at him, a social worker is called to look into the matter - sending Frankie into a panic to give off the image that the Hecks are a picture-perfect family. Meanwhile, Bob must help an uncooperative Mr. Ehlert shoot a new commercial advertising the car lot.</p>"
      },
      { 
         "number": "8",
         "name": "Thanksgiving",
         "description": "<p>Frankie’s dream of an idyllic family Thanksgiving is thwarted when Mr. Ehlert forces the staff to work on the holiday.  Meanwhile, Frankie and Mike approve of a clueless Sue’s first boyfriend – who turns out to be a safe choice – and a panicked Axl loses Brick in a corn maze.</p>"
      },
      { 
         "number": "9",
         "name": "Siblings",
         "description":"<p>Frankie observes what she thinks are the perfect siblings, and it becomes her mission in life to make her kids stop fighting with one another and interact as a loving family. Meanwhile, Mike contemplates firing Aunt Edie after she makes a costly mistake at the quarry.</p>"
      },
      { 
         "number":"10",
         "name":"Christmas",
         "description":"<p>While Frankie focuses on rehearsing for a solo in her church's midnight Christmas mass, Mike takes over handling the chores of setting up the Heck family Christmas. But Frankie becomes a bit jealous when it seems that Mike is doing a better job at organizing the holiday than she would have done. Meanwhile, Frankie and Mike try to help Brick overcome a problem in order to get into the holiday spirit.</p>"
      },
      {
      "number":"11",
      "name":"The Jeans",
      "description":"<p>Frankie and Mike must endure the unpredictability of teenagers when a hormonally charged Sue wants a cool pair of jeans in order to fit in with her peers – and Axl wants a car to impress a girl. Meanwhile, in an attempt to teach Brick about responsibility, Frankie and Mike reluctantly allow him to take care of Aunt Edie and Aunt Ginny’s dog Doris for a few days.</p>"
      },      
      {
        "number":"12",
        "name":"The Neighbor",
        "description":"<p>Frankie fears that a confrontation with trashy neighbor Rita Glossner (guest star BROOKE SHIELDS) is at hand when Sue has a run-in with her sons. Meanwhile, Axl tries to bribe Brick when he’s asked to teach his little brother how to kick a ball for a gym requirement. But it’s Brick who turns the tables on Axl and ends up bribing him for another favor.</p>"
      },
      {
        "number":"13",
        "name":"The Interview",
        "description":"<p>Mike’s discovery of a dinosaur bone in the quarry causes the plant to get shut down for scientific research – leaving him out of a job. But Mike begins to feel like a dinosaur himself when he discovers how drastically things have changed technologically over the years in terms of searching for a job. Meanwhile, Frankie feels she must once again come to Brick’s rescue when he decides to run for school historian.</p>"
      },
      {
        "number":"14",
        "name":"The Yelling",
        "description":"<p>Frankie vows to stop yelling at and nagging her kids if they agree to follow-through on their schoolwork and chores without her intervention. Meanwhile, Mike reluctantly takes a night job as a driver delivering snack cakes with Bob.</p>"
      },
      {
        "number":"15",
        "name":"Valentine’s Day",
        "description":"<p>Valentine’s Day unexpectedly finds Frankie and Mike home alone and ready for a romantic evening while Brick is away at his first sleepover, Sue goes to her first boy-girl party, and Axl has a big date night planned with some friends. But Cupid’s arrow doesn’t exactly hit the target, and the best-laid plans soon begin to unravel.</p>"
      },
      {
        "number":"16",
        "name":"The Bee",
        "description":"<p>When Mike discovers that Brick is a spelling wiz and won the school spelling bee, he puts all of his efforts into training him to win the regional bee, which could ultimately lead to competing in the Scripps Spelling Bee. But as the family gets set for their road trip to Chicago for the regional bee, Frankie and Mike are horrified when they realize they forgot one thing – Sue’s birthday.</p>"
      },
      {
        "number":"17",
        "name":"The Break Up",
        "description":"<p>Frankie and Mike are excited to discover that Axl has found the perfect girlfriend, Morgan (guest star ALEXA VEGA – Spy Kids), and that he’s in love.  But just as they start to get used to his new, sunny outlook on life, Morgan does the unthinkable and breaks up with him – leaving Axl completely heartbroken.  Meanwhile, Sue learns that she’s not the greatest of babysitters when she’s put in charge of watching Brick and freaks him out (as well as herself) by letting him watch a scary movie.</p>"
      },
      {
        "number":"18",
        "name":"The Fun House",
        "description":"<p>Frankie fears her job at the car dealership may be on the line when hardcore motivational consultant Abby (guest star AMY SEDARIS) is hired to whip the sales staff into shape. Meanwhile, with Frankie putting in extra hours at work, Mike has to deal with issues at home, including getting a pool table in order to make the house more fun for Axl and his friends, giving advice to Sue’s slightly confused ex-boyfriend, and helping Brick with a school project.</p>"
      },
      {
        "number":"19",
        "name":"The Final Four",
        "description":"<p>Mr. Ehlert takes a liking to Mike and presents him with two tickets to the Final Four – Mike’s dream come true! But when Frankie’s uncle passes away and the funeral is set for the day of the game, a battle begins to brew as Frankie forces Mike to choose which life event is most important to him. Meanwhile, Sue attempts to help Brick get out of going to a birthday party by impersonating Frankie over the phone but panics when she realizes that Frankie is going to make a call for real in order to get him out because of the funeral.</p>"
      },
      {
        "number":"20",
        "name":"TV or Not TV",
        "description":"<p>After having their power turned off because they couldn’t afford to pay their electric bill on time, Frankie and Mike decide to cut out unnecessary expenses – starting with their cable TV.  But while the kids adapt to the change by doing other activities, Frankie and Mike find themselves not knowing how to fill in the time they used to spend in front of the tube.  Meanwhile, Brick and his fellow socially challenged friends are dealt a major blow when the school library is closed during recess, and they are forced into the outside world on the playground with their fellow students.</p>"
      },
      {
        "number":"21",
        "name":"Worry Duty",
        "description":"<p>Frankie is worried that Axl’s going to get his heart crushed again when his on-again/off-again girlfriend, Morgan (guest star ALEXA VEGA), re-enters his life and tries to mold him into the man she wants him to be. Meanwhile, Brick learns what it means to be a mother hen when he has to watch over a baby chick for a school science project.</p>"
      },
      {
        "number":"22",
        "name":"Mother’s Day",
        "description":"<p>Mother’s Day for Frankie is anything but serene when she finds herself doing more for Mike and the kids and less for herself. But Frankie learns that the apple doesn’t fall far from the tree when she escapes the family for a few hours to go to her mom’s (guest star MARSHA MASON – The Goodbye Girl, Chapter Two) house and ends up acting like a child by making her wait on her hand-and-foot. Meanwhile, Sue feels guilty when she steals a motivational magnet from a store whose message actually enticed her to shoplift it.</p>"
      },
      {
        "number":"23",
        "name":"Signals",
        "description":"<p>The Heck family BBQ is being planned as spring rolls around, and Mike decides it's time for he and Brick to attempt to be more social at the event when Frankie points out that Mike's own social ineptness was passed on to Brick. Meanwhile, Axl sets out to clean the family pool in order to entice the girls to stop by for a swim ­– in their bikinis; and Sue finally finds someone who totally understands her – church youth group leader Reverend TimTom (guest star PAUL HIPP) – but upon learning that he may be leaving the parish due to budget cuts, she attempts to raise money to help finance his stay.</p>"
      },
      {
        "number":"24",
        "name":"Average Rules",
        "description":"<p>After attending year-end school parent-teacher conferences, Frankie and Mike are shocked to discover that Brick may be held back from going to the third grade because the school librarian, Mrs. Nethercott (guest star BETTY WHITE), has it out for him due to 31 unreturned books; and Axl’s aptitude test results reveal him to be academically gifted. But Frankie makes it her mission to get an overlooked Sue the recognition she deserves when none of her teachers even realize that she’s in their classes.</p>"
      }
    ]
  },
  {
    "number": "2",
    "episodes": [
      {
        "number":"25",
        "name":"Back to School",
        "description":"<p>PATRICIA HEATON stars as Frankie Heck, a harried wife and working mother of three who uses her wry wit and sense of humor to try to get her family through each day intact. Her work life’s no easier. With her friend and co-worker, Bob Weaver (series star CHRIS KATTAN), she struggles day to day as the least successful saleswoman in Orson, Indiana’s only surviving car dealer. Frankie’s unflappable husband, Mike (series star NEIL FLYNN), is a manager at the local quarry and her sardonic partner in the daily grind that is raising their average – yes, most definitely average – family. In between juggling shifts and picking up fast food dinners eaten in front of the TV, Frankie and Mike raise their kids with love and solid Midwestern practicality. Axl (series star CHARLIE McDERMOTT) is the oldest, a teenage jock who eats the family out of house and home and walks around in his underwear. Then there's Sue (series star EDEN SHER), their extraordinarily ordinary teen daughter who fails at just about everything she tries with great gusto – although she’s hoping her recent acceptance on the school’s beleaguered no-cut cross country team might just turn things around. Finally, there’s Brick (series star ATTICUS SHAFFER), their quirky third-grader, who reads constantly, whispers to himself and has a best friend who’s his backpack.</p><p>After a disastrous attempt to get her kids ready for the first day of school, Frankie devises a plan to stay on top of her kids’ schedules in order to better organize their lives. But things go from bad to worse when Frankie – aided by a reluctant Mike – tries to be preemptive and explains Brick’s eccentric quirks to his new, no-nonsense teacher, Ms. Rinsky (guest star DORIS ROBERTS), and gets accused of being over protective. Meanwhile, Sue is so enthusiastic about being on the school’s cross-country team that she wears a heavy sweatshirt touting her team spirit in 80-degree heat, and Axl’s body clock gets thrown for a loop when Frankie begins waking him up for school with an alarm clock, on the second season premiere.</p>"
      },
      {
        "number":"26",
        "name":"Homecoming",
        "description":"<p>Axl has just made the varsity football team, much to Frankie’s delight, and she looks forward to a life-long dream of dressing up and walking him out on the field with Mike during homecoming.  However, when she learns that Sue’s first cross-country meet is the same day, Frankie and Mike must each make a Sophie’s Choice-like decision on which kid’s activity to attend.  Meanwhile, Mike gets Brick to rake up the leaves in the yard but is thrown when instead of taking them to the dump, Brick wants to set them free in the forest.</p>"
      },
      {
        "number":"27",
        "name":"The Diaper Incident",
        "description":"<p>While shopping for baby diapers for Sue, who has run out of them on a baby-sitting job, Frankie is completely humiliated when a clerk assumes she’s shopping for adult diapers. Meanwhile, after getting on Mike’s case to get a physical exam because she thinks men tend to fall apart faster than women as they age, Frankie proceeds to throw out her back and hides it from Mike, who tells her he received a clean bill of health from the doctor; a clueless Sue falls for Axl’s friend Sean, who barely notices her existence; and Brick begins to test all of the age-old urban legends parents tell their kids – such as not to swallow a watermelon seed for fear one will grow in their belly – after discovering Frankie has used these white lies on him in the past.</p>"
      },
      {
        "number":"28",
        "name":"The Quarry",
        "description":"<p>When Axl is suspended for skipping school, Mike decides it's time to teach his son a lesson about life and makes him go to work with him at the quarry. But Mike's master plan backfires when Axl likes the job so much that he wants to quit school and lead the life of a quarryman. Meanwhile, Frankie is devastated when she fears that she accidentally prayed away Sue's cross-country team after it's cut by the school; and while practicing a magic trick, Brick makes the main TV remote disappear - and can't figure out how to make it reappear.</p>"
      },
      {
        "number":"29",
        "name":"Foreign Exchange",
        "description":"<p>Frankie’s best laid plans go awry when she convinces Mike and the kids that the Heck family should host a foreign exchange student from Japan (guest star MATTHEW MOY) to expose him to life in an average American family. But the Hecks become frustrated when the student shows no sign of interest whatsoever in the family.</p>"
      },
      {
        "number":"30",
        "name":"Halloween",
        "description":"<p>Excited over being invited to the neighborhood Halloween party, Frankie encourages Mike to dress up in costume – but he might just have his own idea of fun. Meanwhile, a melancholy Sue’s spirits are lifted when she discovers that Reverend TimTom (guest star PAUL HIPP) is back in town and hosting a Halloween church event; things don’t go quite as planned for Axl, his friends and their dates as they head out to an exclusive haunted house party; and Brick chooses a unique Halloween costume that is not easily defined.</p>"
      },
      {
        "number":"31",
        "name":"A Birthday Story",
        "description":"<p>Frankie and Mike are speechless when, on his ninth birthday, Brick demands to hear the true story about the day he was born, which has remained a mysterious Heck family secret.  Meanwhile, Axl's new manager at the movie theater turns out to be a conundrum – hot and dumb – which leaves a confused Axl wondering if her hotness trumps her incompetence.</p>"
      },
      {
        "number":"32",
        "name":"Errand Boy",
        "description":"<p>Brick is sick and tired of being forced to accompany Frankie on her weekend errands and pleads with her to let him stay home alone. Meanwhile, Mike is torn over how to deal with Sue’s friend when he overhears her diss his daughter. And, with his fellow teammates all growing beards for the football playoffs, Axl attempts to grow one of his own – with mixed results.</p>"
      },
      {
        "number":"33",
        "name":"Thanksgiving II",
        "description":"<p>Mike begrudgingly invites his brother Rusty (guest star NORM MACDONALD), who is temporarily living in a tent, and his father Big Mike (guest star JOHN CULLUM), who has recently broken his hip, to join him for the annual Heck family Thanksgiving. But when Frankie observes the macho Heck men’s non-communicative nature, she encourages a not-so-receptive Mike to engage them in a real conversation and express their feelings. Meanwhile, Brick is ecstatic when he discovers that Bob is bringing his girlfriend Lisa – the local librarian who loves books as much as Brick does – to Thanksgiving; and Sue wants to start a mother-daughter tradition of baking a pie for the holiday but ends up getting more sliced up than the crust.</p>"
      },
      {
        "number":"34",
        "name":"A Simple Christmas",
        "description":"<p>The Hecks countdown the 12 days of Christmas with Frankie’s parents, Pat (guest star MARSHA MASON) and Tag (guest star JERRY VAN DYKE), when they come to town to spend the holiday with the family – much to Mike’s dismay.  But when Frankie decides that she wants to take the focus off of the gifts and make it a simple Christmas, Pat and Tag have other ideas in mind.</p>"
      },
      {
        "number":"35",
        "name":"Taking Back the House",
        "description":"<p>After years of being at their kids’ beck and call and never having time for themselves, Frankie and Mike decide to take charge of their lives and regain control over the Heck household. But Axl, Sue and Brick don’t plan on going down without a fight.</p>"
      },
      {
        "number":"36",
        "name":"The Big Chill",
        "description":"<p>Mike freezes Frankie out because he can’t fathom how she inadvertently paid $200 for a small bottle of eye cream that she thought was priced at $20. Meanwhile, Axl's fathering techniques are put to the test when he has to take care of a mechanical infant doll for health class; and Sue and Brick desperately search for a way to fix a hole that they caused in Sue's bedroom wall.</p>"
      },
      {
        "number":"37",
        "name":"Super Sunday",
        "description":"<p>As the Super Bowl approaches, Mike is thrilled when Brick takes his advice and studies up on football in order to understand and talk the sport. But Axl thinks his little brother is taking over his turf by being Mike’s football buddy – a position Axl used to cherish. Meanwhile, Frankie thinks her professional career is looking up when Mr. Ehlert (guest star BRIAN DOYLE-MURRAY) chooses her to accompany him to a managerial seminar, and ex-boyfriend Brad (guest star J. BROCK CIARLELLI) asks Sue to be his dance partner for the school’s annual Square Dancing with the Stars.</p>"
      },
      {
        "number":"38",
        "name":"Valentine’s Day II",
        "description":"<p>As Valentine’s Day approaches, Frankie becomes elated when elusive son Axl asks her to accompany him to help pick out a present and choose a restaurant to impress his mysterious new girlfriend – who may be way out of his league. Meanwhile, Mike inadvertently spills the beans about Brick’s crush on fellow student Autumn (guest star ISABELLA ACRES), which totally humiliates his extremely shy son; and forgetting to get a name or e-mail address, Sue begins a diligent search for the boy she kissed during a Halloween hayride.</p>"
      },
      {
        "number":"39",
        "name":"Friends, Lies and Videotapes",
        "description":"<p>Fearing that a friendless Brick could be missing out on his childhood, Frankie makes it her mission to find a suitable friend for him. Meanwhile, after Mike forbids Sue from seeing an R-rated film, she goes against her father’s wishes and sneaks into a movie theater with her friend Carly (guest star BLAINE SAUNDERS); and Axl and his band need a hot chick to appear in their online music video and attempt to shoot footage of their sexy biology teacher, Ms. Devereaux (guest star KRISTIN CAVALLARI) – without her knowledge or consent.</p>"
      },
      {
        "number":"40",
        "name":"Hecks on a Plane",
        "description":"<p>After Sue wins a family trip to New York, Murphy’s Law goes into full effect and it’s anything but a smooth flight, when the Hecks board a plane and fly to the Big Apple.</p>"
      },
      {
        "number":"41",
        "name":"The Math Class",  "description":"<p>Written by: Jana & Mitch Hunter</p><p>Directed by: Alex Reid</p><p>Frankie once again goes head-to-head with Brick’s third grade teacher, Ms. Rinsky (guest star DORIS ROBERTS), when Brick gets a ‘D’ on his math test, and Frankie thinks bad teaching skills are to blame. But Frankie wonders whether or not she can make the grade when Ms. Rinsky makes her and Mike attend a class to test their own math skills. Meanwhile, Axl and Sue, while begrudgingly watching over their crusty, old aunts, mull over a plan to accompany Aunt Edie on a search for a time capsule she had buried years ago when she was young.</p>"
      },
      {
        "number":"42",
        "name":"Spring Cleaning",
        "description":"<p>Spring Break turns out to be anything but peaceful when the Hecks attempt to clean up 20 years of junk accumulated throughout the house. But digging up the past leads to things that were better left buried and forgotten. Meanwhile, Brick opens up a lucrative neighborhood information stand, giving advice on everything for a dollar per query.</p>"
      },
      {
        "number":"43",
        "name":"The Legacy",
        "description":"<p>After receiving multiple warnings about leaving his dirty, smelly socks lying around the house, Mike has finally had enough and punishes Axl by forbidding him to play in the final school basketball game of the season. But everyone assumes that Mike is being petty when they discover that Axl could end up beating his father’s record for most free throws landed in a season if he plays in the game. Meanwhile, Sue is ecstatic – but Frankie and Mike are suspicious – when she wins a MVP trophy for cross-country, and Brick is humiliated when he’s forced to wear hand-me-down clothes from his rebellious cousin.</p>"
      },
      {
        "number":"44",
        "name":"The Royal Wedding",
        "description":"<p>Obsessed with the upcoming royal wedding, Frankie shocks her family when she treats the event like the Super Bowl and begins purchasing commemorative “tchotchkes” – as well as an expensive HDTV – to enjoy the festivities. Meanwhile, Brick attempts to teach Sue how to become an on-air reporter when she decides to try out as an anchor for the school’s Shucker News Team, and Mike has a mutiny on his hands at the quarry when he’s forced to make cutbacks and takes away the one thing his workers care about – free pretzels.</p>"
      },
      {
        "number":"45",
        "name":"Mother’s Day II",
        "description":"<p>Mother’s Day for Frankie turns out to be anything but serene when Mike and the kids present Frankie with the perfect Mother’s Day gift – a day to herself. But when her special day off goes awry, Mike offers a do-over with the family, which comes complete with its own set of glitches.</p>"
      },
      {
        "number":"46",
        "name":"The Prom",
        "description":"<p>After learning that Axl text-invited the wrong girl to prom and plans to solve the situation by standing her up, Frankie and Mike demand that he meet the girl face-to-face in a timely manner to gently break off the date – or face the music and take her to the big event. Meanwhile, Sue and her friend Carly (guest star BLAINE SAUNDERS) try in earnest to fit in with the school’s “B” crowd during lunch. And, after a successful first show, Brick begins to bore Frankie and Mike with his impromptu one-man plays.</p>"
      },
      {
        "number":"47",
        "name":"The Bridge",
        "description":"<p>Frankie and Mike attempt to cure Brick of his irrational fear of crossing over bridges. Meanwhile, Axl is pitted against nemesis Sean Donahue (guest star BEAU WIRICK) when a lifeguard position opens up at the local public pool, and Frankie is ready to pull her hair out when she tries to help an indecisive and emotional Sue pick out a two-piece bathing suit to wear on the pool’s opening day.</p>"
      },
      {
        "number":"48",
        "name":"Back to Summer!",
        "description":"<p>With only three days left until summer vacation, Frankie is ecstatic that she’s made it through another school year with the family. But her happiness turns to panic when she and Mike learn that Brick needs to write a daily journal and turn it in to Ms. Rinsky (guest star DORIS ROBERTS) or risk not moving up to the fourth grade; Axl hasn’t fulfilled his required 30 days of community service; and because of an error, Sue must prove that she never took a sick day from school in order to receive a perfect attendance award at her middle school graduation ceremony.</p>"
      }
    ]
  },
  {
    "number": "3",
    "episodes": [
      {
        "number":"49 & 50",
        "name": "Forced Family Fun part 1 & 2",
        "description":"<p>Middle-aged, middle class and living in the middle of the country in Orson, Indiana, Frankie Heck (series star PATRICIA HEATON) is a harried wife and working mother of three who uses her wry wit and sense of humor in an attempt to get her family through each day intact. Her work life’s no easier as she struggles day to day as the least successful sales woman at the town’s only surviving car dealer.</p><p>Frankie’s unflappable husband, Mike (series star NEIL FLYNN), is manager at the local quarry and her sardonic partner in the daily grind that is raising their average – yes, most definitely average – family. Between juggling shifts and picking up fast food dinners eaten in front of the TV, Frankie and Mike raise their kids with love, humor and solid Midwestern practicality. Axl (series star CHARLIE McDERMOTT), the oldest, is a jock slacker who eats them out of house and home and walks around the house in his underwear. Then there’s Sue (series star EDEN SHER), their extraordinarily ordinary teen daughter, who fails at just about everything she tries with great gusto. This year she’s entering high school and will attempt to not only navigate the raging waters of school life but co-exist with Axl, who is not too thrilled with his little sister being at the same school. And last is Brick (series star ATTICUS SHAFFER), their quirky fourth-grader, who reads constantly, whispers to himself and unapologetically marches to the beat of his own drummer. But through all the madness shines a loving family, and together, the Hecks are putting THE MIDDLE on the map.</p><p>With school about to start in a few days, Frankie realizes that she and Mike have barely spent any time together with the kids over the summer – so she insists that they take a short family vacation. But when Mike decides that the perfect family getaway is a camping trip, memories of their campsite honeymoon 19 years earlier – which was ruined by Nicky (guest star RAY ROMANO), a sad-sack, former high school acquaintance of Mike's – come flashing back, on the third season premiere.</p>"
      },
      {
        "number":"51",
        "name":"Hecking Order",
        "description":"<p>With Sue now in high school, Axl (who is totally embarrassed by her presence) decides to play a mischievous trick on her, which earns his perfectionist sister a collection of tardy slips. Meanwhile, Mike sets a meeting with Brick’s new fourth grade teacher, Mr. Wilkerson (guest star CHORD OVERSTREET), after learning that he’s allowing his son to skip gym class; and Frankie and Mike bicker over which one of them is really the boss of the family.</p>"
      },
      {
        "number":"52",
        "name":"Major Changes",
        "description":"<p>After being mortifyingly humiliated and grossed out due to a family member’s actions, Frankie has a meltdown and decrees to the family that major changes need to take place in every aspect of the Heck household – and then packs up and abruptly leaves. But Frankie’s not gone for good as she heads to her mother’s (guest star MARSHA MASON) house for a little TLC and motherly advice to help her through the humiliation.</p>"
      },
      {
        "number":"53",
        "name":"The Test",
        "description":"<p>Frankie cracks down on Axl and forces him to focus on his future when she learns that the school PSATs are right around the corner, and he hasn't even begun to study for them. Meanwhile, Sue once again tries out for a school activity that may not be a perfect fit for her – cheerleading; and Mike tries to toughen up Brick when he learns that his son is being bullied at school.</p>"
      },
      {
        "number":"54",
        "name":"Bad Choices",
        "description":"<p>As the Heck home begins to literally fall apart, Frankie and Mike consider leaving homeownership behind and moving the family to an apartment. Meanwhile, Axl attempts to fake Frankie out by pretending that he’s sick in order to get out of taking a school test – and must later convince her that he’s well enough to attend a party that evening; Sue and her ex-sort-of-boyfriend Brad volunteer to prepare a school skit about showing the dangers of texting and drinking while driving; and Brick tries to offer a little bit of brevity by spouting off Shakespearian quotes.</p>"
      },
      {
        "number":"55",
        "name":"Halloween II",
        "description":"<p>After being embarrassed over wearing a childish costume at a high school Halloween costume party and being ignored by the guys, Sue asks a flabbergasted Mike for his advice on what boys want when it comes to girls. Meanwhile, Frankie reluctantly volunteers to take Brick’s socially awkward school social skills group trick-or-treating; and Axl and his friends devise a plan to trick rather than treat the neighborhood kids on Halloween.</p>"
      },
      {
        "number":"56",
        "name":"Heck’s Best Thing",
        "description":"<p>Frankie and Mike are convinced that their slacker son Axl will blow his interview with a football scout, which could earn him a scholarship to college. Meanwhile, Sue and Brick begin a texting marathon – and accidentally rack up some serious charges – on Aunt Edie’s cell phone; and Frankie attempts to be completely attentive to the family’s needs when she realizes that she’s more considerate to outsiders than her own kin.</p>"
      },
      {
        "number":"57",
        "name":"The Play",  "description":"<p>Story by: Roy Brown & Jana Hunter & Mitch Hunter</p><p>Frankie is thrilled when she learns that the Orson Community Theater is putting on a production of The Wizard of Oz, and that kids don’t need to audition to be munchkins as they will be automatically cast – which is a perfect scenario for a hapless Sue. But things quickly go awry when Frankie is cast in a singing role and learns the director is not happy with Sue’s performance and may cut her from the play. Meanwhile, Brick asks his unreliably quirky Uncle Rusty (guest star NORM MACDONALD) to attend his school’s “Special Friends Day” – with disastrous results.</p>"
      },
      {
        "number":"58",
        "name":"Thanksgiving III",
        "description":"<p>Frankie’s parents, Pat (guest star MARSHA MASON) and Tag (guest star JERRY VAN DYKE), invite the Hecks to spend a few days at their house to celebrate Thanksgiving together. But the festivities begin to fall apart quickly when Frankie’s sister Janet (guest star MOLLY SHANNON) and her family also join in, and soon the siblings are at each other’s throats over their widely differing parenting techniques. Meanwhile, Mike attempts to offer some advice to Axl on how to pick up girls when he witnesses his son trying to impress a pretty mini-mart cashier – and fails miserably; Brick attempts to prove his innocence when he is accused by Janet of damaging her daughter’s expensive toy; and Sue is thrilled when Frankie, Pat and Janet invite her to take part in their gossip sessions.</p>"
      },
      {
        "number":"59",
        "name":"A Christmas Gift",
        "description":"<p>On a tipsy whim – and against Mike’s warnings – Frankie decides to throw a Christmas Eve party at the house; Mike buys Frankie a much needed new dishwasher for Christmas but has a hard time keeping it a secret when she begs him to replace the old one before the party takes place; Sue calls on Reverend TimTom (guest star PAUL HIPP) to explain the meaning of Christmas to Brick when he reads the Bible and begins to question it; and Axl gets annoyed with Bob (recurring guest star CHRIS KATTAN) when he tries too hard to be cool in order to befriend him while working together on a Christmas tree lot.</p>"
      },
      {
        "number":"60",
        "name":"Year of the Hecks",
        "description":"<p>After realizing that no one keeps their New Year’s resolutions, Frankie decides that they will be assigned anonymously to each family member, and an all-you-can-eat buffet feast will be the reward for those who can abide by their chosen resolution for a week. But chaos soon ensues when Frankie must spend more time with Brick, Mike needs to smile more, Axl has to keep his bedroom clean, Sue needs to stop trying out for things she’ll never make, and Brick must stop reading all of the time.</p>"
      },
      {
        "number":"61",
        "name":"The Map",
        "description":"<p>After attending Aunt Ginny’s funeral, Frankie begins to fear that the family is missing out on important life milestones and vows to begin celebrating all of them. Meanwhile, Axl accidentally eats Brick’s Indiana dough school map project and is tasked with creating a new one, and Sue discovers that one of the boys on the wrestling team has a crush on her.</p>"
      },
      {
        "number":"62",
        "name":"Hecking it Up",
        "description":"<p>With Indiana hosting the Super Bowl, Frankie is devastated when she hopes to land a plum assignment as an official volunteer and ends up with a less-than-stellar  position.  Meanwhile, the entire Heck household takes advantage of the Donahue’s new car while they are out of town, and a scary, close call with the car causes Sue to profess her true feelings to her new boyfriend, Matt.</p>"
      },
      {
        "number":"63",
        "name":"Valentine’s Day III",
        "description":"<p>Frankie and Mike decide to try a fresh approach to Valentine’s Day by having dinner out with friends.  But a clueless Mike angers Frankie by refusing to present her with a simple romantic gesture.  Meanwhile, Axl can’t think of a life-changing moment that’s occurred in his life when he’s assigned to write a school paper on the subject, Brick is tasked with writing a report on love, and a hapless Sue doesn’t understand why her new boyfriend, Matt (guest star MOISES ARIAS), has suddenly turned into a “bad kisser.”</p>"
      },
      {
        "number":"64",
        "name":"The Concert",
        "description":"<p>Frankie pulls out all of the stops in an effort to get an overexcited Sue tickets to a Justin Bieber concert; Mike is thrilled over Brick’s enthusiasm to win the school’s spelling bee and coaches him for the event; and Axl and his friends attempt to break an electronic speed limit road sign’s 15 miles per hour limit – on foot.</p>"
      },
      {
        "number":"65",
        "name":"The Sit Down",
        "description":"<p>Axl, Sue and Brick call a sit down meeting with a shocked Frankie and Mike, accusing mom of being a nag and dad of giving out crazy punishments without ever hearing their sides of the story.  In return, all they ask for is a chance to do what they’re supposed to do – on their own – without constantly being harassed by their parents.  But the kids might want to be careful what they wish for when Frankie and Mike agree to their terms and find themselves taking a relaxing break from parental responsibility.</p>"
      },
      {
        "number":"66",
        "name":"Leap Year",
        "description":"<p>Because this year is a leap year and Sue’s birthday falls on February 29, she is overly excited about celebrating her big day in a big way.  But given her parents’ track record with celebrations, Sue may need to lower her expectations.  Meanwhile, Frankie discovers that tough husband Mike has been taking care of a stray cat at work for years, Brick falls for a pretty girl in his social skills class, and Axl becomes enthralled with vacuuming the house.</p>"
      },
      {
        "number":"67",
        "name":"The Paper Route",
        "description":"<p>Brick takes a job as a newspaper delivery boy from the town's veteran newsman (guest star EDWARD ASNER) in order to buy himself night vision goggles, and Axl tries to convince Sue that a long distance relationship will not work between her and boyfriend Matt when his family moves away from Orson.  Meanwhile, Sue attempts to adjust to wearing a full-on headgear, and Frankie discovers that Mike has been secretly hoarding batteries for years.</p>"
      },
      {
        "number":"68",
        "name":"Get Your Business Done",
        "description":"<p>When the Hecks attend a new church, Frankie is inspired by the pastor’s sermon about getting one’s business in life completed before death rears its ugly head. So she makes it her mission to ensure that her family puts it into practice.  To that end, Mike wants to thank his dad for being there for him and his brother after their mom died, Sue starts up her own babysitting service, and Brick thinks a new bed will meet the requirement, while Axl believes that helping Brick get his new bed will fulfill his. But Frankie finds it difficult to figure out what it is that she should be doing to fulfill her own life’s destiny.</p>"
      },
      {
        "number":"69",
        "name":"The Guidance Counselor",
        "description":"<p>Sue finds a kindred spirit in her awkward school guidance counselor, Jane Marsh (guest star WHOOPI GOLDBERG), who inspires her to reinvent herself…as Suki. Meanwhile, Frankie is ecstatic when she and Mike buy a much needed new bed but is frustrated when her stubborn husband insists on trying to build it himself; and Brick attempts to call the President to outlaw the Presidential Fitness Challenge, which would force him to accomplish some strenuous physical exercises at school.</p>"
      },
      {
        "number":"70",
        "name":"The Clover",
        "description":"<p>Brick gets anything but good luck after he finds an evil four-leaf clover. Frankie makes a decision to find a caregiver for Aunt Edie (guest star JEANETTE MLLER) after she almost burns down her house. Axl tries to devise a plan that will keep his status as a lady’s man in play after he once again accidentally invites “weird” Ashley (guest star KATLIN MASTRANDREA) to the prom. Mike gets upset with his dad, Big Mike (guest star JOHN CULLUM), when he's accused of being too soft on Brick. and Axl is horrified when his friend Darrin (guest star JOHN GAMMON) asks Sue to the prom.</p>"
      },
      {
        "number":"71",
        "name":"The Telling",
        "description":"<p>It seems like Frankie truly has eyes in the back of her head when she busts both Sue and Axl for making some bad choices that they thought no one would ever find out about. But when it turns out that she's using Brick to be her snitch, Mike is completely against it. Meanwhile, Axl’s weekend getaway to the lake is in peril when Sue discovers him sneaking into the house in the middle of the night and coerces him into doing whatever she commands - otherwise she will tattle on him; and when Frankie is stuck at work, Mike is forced to attend Parent Day at Brick's school.</p>"
      },
      {
        "number":"72",
        "name":"The Wedding",
        "description":"<p>On the third season finale, Frankie and Mike are surprised to receive an invitation to Mike's brother Rusty's fast approaching wedding. But their surprise turns to panic when they discover that he has listed the Heck house as the site of the ceremony…without asking them. Meanwhile, Axl and his friends decide to become their own bosses and set out to form their own company to garner summer jobs, and Brick is upset with Mike when he finally accepts an invitation to a fellow student's party but is not allowed to go because it falls on the same day as the wedding.</p>"
      }
    ]
  },
  {
    "number": "4",
    "episodes": [
      {
        "number":"73 & 74",
        "name":"Last Whiff of Summer – parts 1 & 2",
        "description":"<p>Middle-aged, middle class and living in the middle of the country in Orson, Indiana, Frankie Heck (series star PATRICIA HEATON) is a harried wife and working mother of three who uses her wry wit and sense of humor in an attempt to get her family through each day intact. Her work life’s no easier as she struggles day to day as the least successful sales woman at the town’s only surviving car dealer. But an unexpected turn of events at work could force her to re-evaluate her career.</p><p>Frankie’s unflappable husband, Mike (series star NEIL FLYNN), is manager at the local quarry and her sardonic partner in the daily grind that is raising their average – yes, most definitely average – family. Between juggling shifts and picking up fast food dinners eaten in front of the TV, Frankie and Mike raise their kids with love, humor and solid Midwestern practicality. Axl (series star CHARLIE McDERMOTT), the oldest, is a high school senior and jock slacker who eats them out of house and home and walks around the house in his boxers. But his lazy days may be numbered when Mike makes it his mission to ensure that Axl will somehow earn a sports scholarship and be able to attend college next year. Then there’s Sue (series star EDEN SHER), their extraordinarily ordinary teen daughter, who fails at just about everything she tries with great gusto. Now a sophomore in high school, she continues to navigate the raging waters of school life and, to Frankie and Mike’s horro, will even attempt to get her driver’s license. And last is Brick (series star ATTICUS SHAFFER), their quirky fifth-grader, who reads constantly, whispers to himself and unapologetically marches to the beat of his own drummer. But through all the madness shines a loving family, and together, the Hecks are putting THE MIDDLE on the map.</p><p>On the fourth season premiere, Frankie's plans to recreate the magic of her own childhood summers are foiled when Mike lets it slip that Axl is his favorite Heck child, and Frankie tries to coax the kids into telling them who their favorite parent is. Meanwhile, when Frankie and Mike discover that Axl failed English during the past school year, they force him to make it up in summer school, otherwise he could jeopardize any chance of getting a college sports scholarship after graduation; Brick takes up growing a tomato for his summer project; and Sue tries to bond with a reluctant Mike and attempts to get him to do numerous activities with her, which she plans to document in a giant scrapbook.</p>"
      },
      {
        "number":"75",
        "name":"The Second Act",
        "description":"<p>When Frankie is suddenly fired from Ehlert Motors, she embarks on a quest not to repeat mistakes from the past by taking any crummy job that comes her way, deciding to go instead to tech school to secure a real career. Meanwhile, school has begun and Axl is starting his Senior year in high school, Sophomore Sue takes on the task of mentoring new freshman Jenna (guest star BAILEY BUNTAIN – Bunheads), and Mike is upset with Brick when he can’t be bothered to put his book down to meet some of Mike’s friends after a softball game.</p>"
      },
      {
        "number":"76",
        "name":"Bunny Therapy",
        "description":"<p>When Brick develops yet another quirky tic that begins to overshadow his whispering, Frankie and Mike are urged by the school therapist, Dr. Fulton (guest star DAVE FOLEY), to get him a small pet so that he can learn to bond with it, which in turn will help him bond with people.  But when they present Brick with an ill-tempered bunny, the tiny animal teaches the Heck family the true meaning of evil.  Meanwhile, as the Homecoming dance approaches, Axl finds himself dating cheerleaders Courtney and Debbie (guest stars BRITTANY ROSS and NATALIE LANDER) – but he doesn’t know which one of them is actually his girlfriend; and Sue tries out for school mascot.</p>"
      },
      {
        "number":"77",
        "name":"The Hose",
        "description":"<p>Trashy neighbor Rita Glossner (guest star BROOKE SHIELDS) returns and is about to rain fire upon the Heck household when she accuses Frankie of stealing her hose. Meanwhile, Sue takes a peek at Mike’s paycheck and is so shocked at how little he makes that she decides to call off her first official road trip to Cincinnati for her school mascot duties in order to save money; and while Brick learns about the birds and bees in school, Axl shocks his little brother by explaining the whole process in graphic detail.</p>"
      },
      {
        "number":"78",
        "name":"Halloween III: The Driving",
        "description":"<p>As Halloween approaches, the Hecks get quite the scare when Sue receives her learner’s permit, and it’s time for Frankie and Mike to teach her how to drive. But when a freaked-out Sue loses her nerve, she ends up running over Axl’s foot, which could put an end to his high school football career and hopes for a scholarship.  Meanwhile, Axl looks forward to voting in his first election, and Brick undergoes an unexpected transformation when he eats too much Halloween candy.</p>"
      },
      {
        "number":"79",
        "name":"The Safe",
        "description":"<p>Frankie is made an example of in front of the entire class when she doesn’t make a good impression on her first day of dental assisting school with no-nonsense teacher Mrs. Armwood (guest star JANE KACZMAREK). Meanwhile, because Axl’s broken foot may end any chance of him receiving a college sports scholarship, Frankie and Mike insist that he up his grades and get himself a tutor; and Sue and Brick think they’ve stumbled upon an expensive item inside an old safe and try to get big bucks for it from a local pawn store employee (guest star RICK HARRISON – Pawn Stars).</p>"
      },
      {
        "number":"80",
        "name":"Thanksgiving IV",
        "description":"<p>Frankie attempts to do a good deed for Thanksgiving by inviting a couple of Marines (guest stars/former Marines WILLIAM FRANCO VASQUEZ and NICK JONES, JR.) to celebrate the holiday with her family. But with Frankie's parents, Pat and Tag (returning guest stars MARSHA MASON and JERRY VAN DYKE), constantly bickering, the good deed may not go unpunished. Meanwhile, while Axl grapples with his growing feelings for tutor Cassidy (guest star GALADRIEL STINEMAN), he receives the good news that his foot is healed and he can play in the big game; Sue tries to track down the thief who has stolen the chicken head off of her school mascot uniform; and Brick becomes mesmerized by a book on the making of the film, Love Story.</p>"
      },
      {
        "number":"81",
        "name":"Christmas Help",
        "description":"<p>Christmas doesn't seem so merry to Mike when he helps brother Rusty (recurring guest star NORM MacDONALD) move some furniture into the Heck house garage and discovers that Rusty doesn't actually own the items. Meanwhile, Frankie hatches a plan to take a part-time holiday job in a department store in order to get an employee discount to buy presents; Axl turns the garage with the stolen furniture into his own bachelor pad; and Reverend TimTom (guest star PAUL HIPP) makes a bold choice by casting Brick in a holiday play and tasks an overly zealous Sue with baking cookies for the event.</p>"
      },
      {
        "number":"82",
        "name":"Twenty Years",
        "description":"<p>As their 20th anniversary approaches, Frankie begins to think that Mike may be tiring of her company and is purposely trying to avoid her.  Meanwhile, Sue frantically tries to coax Axl and Brick into helping her set up an anniversary party for their parents; and Brick falls into a non-responsive state when Axl tells him the ending of a book he’s been waiting years to read.</p>"
      },
      {
        "number":"83",
        "name":"Life Skills",
        "description":"<p>Axl is shocked to discover that he and Sue are enrolled in the same Life Skills class.  And things only get worse for the “Ax-Man” when he is assigned to work with his sister on a big class project.  Meanwhile, Brick’s school therapist, Dr. Fulton (recurring guest star DAVE FOLEY), attempts to teach him how to reach out to his fellow students in order to make some friends; and Frankie and Mike find themselves dealing with an unreasonable insurance company after they discover a tree branch has fallen and broken the windshield of Frankie’s car.</p>"
      },
      {
        "number":"84",
        "name":"One Kid at a Time",
        "description":"<p>Feeling guilty over not being able to spend enough quality time with each of their kids, Frankie and Mike decide to dedicate each day of a three-day weekend to one of their offspring.  Unexpected revelations emerge when Axl takes them to a paintball range, Sue talks them into an exhausting itinerary consisting of 17 separate activities, and Brick attempts to bring them to a 'Planet Nowhere' sci-fi book convention.</p>"
      },
      {
        "number":"85",
        "name":"The Friend",
        "description":"<p>Mike is upset with Frankie when he discovers that she set him up on an adult playdate with a new neighbor who shares the same interests. Meanwhile, when the school cheerleaders announce that they're taking over cheering for the wrestlers – thus putting Sue and her Wrestlerettes out of business ­ a determined Sue demands a cheer off; and Brick makes a lovesick Axl begin to question whether he's intellectually stimulating enough for his smart, new girlfriend.</p>"
      },
      {
        "number":"86",
        "name":"The Smile",
        "description":"<p>While other kids begin receiving college acceptance letters and Axl doesn't, Frankie and Mike begin to worry that their son's chances for a sports scholarship have passed him by. Meanwhile, Sue is determined to prove that smiling is contagious as a hypothesis for a school science project, and a relentless Brick begins pestering his parents for an iPad.</p>"
      },
      {
        "number":"87",
        "name":"Valentine’s Day IV",
        "description":"<p>As Valentine’s Day approaches, Axl and partners Sean and Darrin (recurring guest stars BEAU WIRICK and JOHN GAMMON) take Boss Co. to the next level by offering their services to help guys break up with their girlfriends. Meanwhile, Brick becomes upset with Frankie when he discovers that she has thrown out all of the school artwork he has made over the years, Sue is thrilled when ex-boyfriend Matt invites her to the school’s Valentine’s Day dance, and Mike accidentally sends a romantic text meant for Frankie to a co-worker at the quarry.</p>"
      },
      {
        "number":"88",
        "name":"Winners and Losers",
        "description":"<p>As Frankie prepares for her upcoming annual tradition of watching the Oscars on TV, she becomes overly concerned when Brick informs her that he’s taking a three-day school bus trip to Chicago – worried that his unique quirkiness could lead him to become separated from the group.  Meanwhile, Sue wants to find out if Axl’s friend Darrin (recurring guest star JOHN GAMMON) has feelings for her.</p>"
      },
      {
        "number":"89",
        "name":"Wheel of Pain",
        "description":"<p>After accidentally breaking the family room window, Axl, Sue and Brick decide to band together and place the blame on the neighborhood bad seed Glossner kids.  But Frankie and Mike know that the kids aren’t being truthful and put together a wheel of pain, in which the kids must spin the wheel and land on a consequence, hoping that one of them will break down and confess – putting Sue’s “Sue-weet 16 Party” at risk. Meanwhile, Frankie needs to please her no-nonsense dental assisting instructor Mrs. Armwood (guest star JANE KACZMAREK) in order to obtain a prime dental rotation spot.</p>"
      },
      {
        "number":"90",
        "name":"The Name",
        "description":"<p>Frankie's sister, Janet (guest star MOLLY SHANNON), comes to the rescue and offers to help run the Heck household while Frankie studies for her dental assisting school finals. But the sheer amount of disorganization in the house throws perfectionist Janet for a loop. Meanwhile, when Cassidy's ex-boyfriend pays an unexpected visit from college, Axl tries to take the high road and not act like a jealous boyfriend; and Sue wants to legally change her middle name (which is also Sue) in order to have a normal name on her driver's license.</p>"
      },
      {
        "number":"91",
        "name":"The Bachelor",
        "description":"<p>Frankie can't hide her disappointment over who 'The Bachelor' chooses to marry and ends up moping around the house for days about it; Mike attempts to toughen Sue up when she joins the school's tennis team and continually compliments her opponents during their matches; and Axl and Cassidy try to figure out where their relationship stands after their big fight. The Bachelor’s CHRIS HARRISON provides voiceover for the episode.</p>"
      },
      {
        "number":"92",
        "name":"Dollar Days",
        "description":"<p>After successfully graduating from dental assisting school, Frankie attempts to interview for a job but discovers that, when asked about herself, she doesn’t quite know how to describe who she is.  Meanwhile, when Axl gets his band their first paying gig at the Orson Dollar Days, Sue becomes a ‘Yoko’ to boyfriend Darrin’s ‘John’ and begins to offer unwanted advice to the group; and when Brick informs Frankie and Mike that he has joined the Prairie Scouts, Mike ends up reluctantly having to lead his quirky troop’s camping trip. JACK McBRAYER (30 Rock, Wreck It Ralph) guest stars as Dr. Goodwin, who Frankie interviews with for a possible job. Supernatural’s JIM BEAVER guest stars as Brick’s not-so-trustworthy Scout Master, Mr. Stokes.</p>"
      },
      {
        "number":"93",
        "name":"From Orson With Love",
        "description":"<p>After discovering that Sue's life, as defined on Facebook, is pretty pathetic, Frankie creates an online alias (or two or three) and attempts to make her daughter as popular as possible. Meanwhile, after having read Tuesdays with Morrie, Frankie's healthy dad, Tag (recurring guest star JERRY VAN DYKE), coerces Mike into listening to his long-winded life stories on a weekly basis; and Axl and Brick attempt to garner interest in getting a bunch of baby bunnies and kittens adopted by producing a viral video starring the animals in a James Bond knockoff.</p>"
      },
      {
        "number":"94",
        "name":"Hallelujah Hoedown",
        "description":"<p>As Mother's Day approaches, Frankie wants to ensure that Mike gets her something she actually wants for a gift and informs all of the kids of her wish so that at least one of them will clue in a clueless Mike. Meanwhile, Sue asks Reverend TimTom (recurring guest star PAUL HIPP) for advice when she begins to resent her friends’ happiness over getting their driver's licenses after she has repeatedly failed the test, and Cassidy stuns Axl with some bad news during the prom.</p>"
      },
      {
        "number":"95",
        "name":"The Ditch",
        "description":"<p>While waiting in line at the power company to pay a late bill and dressed in her lab coat for her new dental assisting job, people mistake Frankie for a doctor and let her cut in front of them so that she can finish her business quickly and get back to saving lives. But when one of those people shows up at Dr. Goodwin's (guest star JACK McBRAYER – 30 Rock) office for a dental checkup, Frankie must attempt to keep up the charade, which leaves her new employer completely perplexed. Meanwhile, Axl discovers that Sue has a perfect attendance record at school and convinces her to ditch a day and live life on the edge; Dr. Fulton (DAVE FOLEY) tries to find out why Brick is so opposed to going to middle school; and Mike and Axl's fishing trip takes a turn for the worse when a distraction causes Mike to crash the boat he is towing, wedging it into a ditch.</p>"
      },
      {
        "number":"96",
        "name":"The Graduation",
        "description":"<p>As graduation day approaches, tension begins to build between Frankie and Axl when he ignores her requests for answers about the graduation party she's planning for his special day. Meanwhile, Sue hopes that the sixth time’s the charm as she once again attempts to pass her driver's test; and during his final days of elementary school, a forgetful Brick is reminded by Vice Principal Dunlap (guest star MARION ROSS – Happy Days) that he's the class historian and is responsible for putting together a slideshow highlighting the last four years of school in front of a school assembly. Note: This season finale episode was directed by series co-creator and executive producer Eileen Heisler.</p>"
      }
    ]
  }
]