[    
  {
    "name": "frankie",
    "description": "FRANKIE / PATRICIA HEATON",
    "bio": "<p>Patricia Heaton is perhaps best known for her role as Debra Barone on the award-winning series Everybody Loves Raymond. She won two Emmy® Awards for the role and was nominated seven times. In addition to her Emmy® wins, Heaton is also the recipient of the Best Comedy Actress Award from the Viewers for Quality Television, a SAG Award and three SAG nominations in the Best Actress category for her work on 'Raymond.'</p>  <p>Heaton most recently starred opposite Kelsey Grammer in the critically acclaimed comedy series Back to You. She also starred in the Hallmark Hall of Fame film, Front of the Class. Other television credits include a recurring role on ABC's popular series thirtysomething and prominent roles in the series Room for Two, Someone Like Me and Women of the House, as well as the television films A Town Without Christmas and Miracle in the Woods.</p>  <p>On stage, Heaton garnered praise for the role as Stella in the Second Stage production of The Scene, a new play by Theresa Rebeck. She received a Lortel Award nomination for her performance.</p>  <p>Heaton produced and starred in the TNT/FourBoys Films production, The Engagement Ring, She also starred in the TNT/Neil Simon production of The Goodbye Girl and ABC's The Path to 9/11. Her feature film credits include Memoirs of an Invisible Man, Beethoven, New Age and Space Jam.</p>  <p>In addition to her acting and producing credits, Heaton is a bestselling author whose book, Motherhood and Hollywood – How to Get a Job Like Mine, made the New York Times Bestsellers list.</p>  <p>In 2001, Heaton co-founded FourBoys Films, a production company which she runs with her husband, David Hunt. FourBoys' recent productions include The Engagement Ring for TNT and the documentary feature film The Bituminous Coal Queens of Pennsylvania. FourBoys Films also produced the acclaimed film Amazing Grace, directed by Michael Apted, in conjunction with Bristol Bay Productions.  Most recently, FourBoys partnered with MyDamnChannel.com on the web series Versailles, which featured Heaton as an eccentric B-movie star, Evelyn Anders.</p>  <p>Born in Bay Village, Ohio, Heaton now lives in Los Angeles with her husband and four sons.  She was recently honored with a Star on the Hollywood Walk of Fame.</p>"
  },
  {
    "name": "mike",
    "description": "MIKE / NEIL FLYNN",
    "bio": "<p> Born on Chicago's South Side and raised in Waukegan, Illinois, Neil Flynn was the third of six children. Although he performed in plays during his school years, it wasn't until he was getting ready to graduate from Bradley University in Peoria that he began to think that performing was something he could actually do for a living. </p> <p> After college, Flynn returned to Chicago and pursued a career in live theater. He appeared at the prestigious Steppenwolf and Goodman theaters, worked with Aidan Quinn (Hamlet) and Brian Dennehy (Galileo), and was twice a Jefferson Award nominee. He became a mainstay at Chicago's Improv Olympic and went on to become a member of the Second City Comedy Troupe in Chicago. </p> <p> Equally adept at comedy and drama, Flynn has performed a variety of roles on television series, ranging from Sacred Heart Hospital's menacing janitor for eight seasons on Scrubs, Seinfeld, The Drew Carey Show and That 70's Show to C.S.I., Boston Public and NYPD Blue. Other TV appearances include Arli$$, Ellen, Family Law and Smallville. </p> <p> On the big screen, he was seen interrogating Harrison Ford in Indiana Jones and the Kingdom of the Crystal Skull, directed by Steven Spielberg, and is also well known for playing Lindsay Lohan's dad in the hit comedy Mean Girls. His other feature appearances include Hoot, Home Alone 3, The Fugitive, Chain Reaction, Rookie of the Year, Baby's Day Out and Major League. </p> <p> Flynn is a core member of the popular improvisation group Beer, Shark, Mice, which frequently performs at IO West in Hollywood. </p>"
  },
  {
    "name": "axl",
    "description": "AXL / CHARLIE McDERMOTT",
    "bio": "<p>A rising star who has made his presence felt on screens large and small, Charlie McDermott is also adding writer/director to his list of credits with the upcoming film ImagiGary. A coming of age comedy about a freshman in college who rediscovers his imaginary friend, Gary, the film starring McDermott, began production in May in McDermott’s hometown, the suburbs of Philadelphia.</p>  <p>On the big screen, McDermott starred in Hot Tub Time Machine, opposite John Cusack and Chevy Chase.  He will soon be seen alongside Laura Linney and writer/director Leland Orser in Morning. He also appeared in the critically praised Frozen River, earning a Spirit Award Nomination for Best Supporting Actor. The recipient of the Sundance 2008 Jury Prize for Best Dramatic Film, the movie has also been honored by the Gotham Awards, Hamburg Film Festival, National Board of Review and New York Film Critics Circle Awards.</p>  <p>McDermott began his career with M. Night Shyamalan's The Village, alongside Joaquin Phoenix, Adrien Brody, William Hurt and Sigourney Weaver. Additional film credits include a supporting role in the Sundance favorite The Ten, alongside Jessica Alba, Adam Brody, Gretchen Mol, Oliver Platt, Paul Rudd, Winona Ryder and Liev Schreiber; The Sex Drive, opposite Seth Green and James Marsden; and the independent films All Along and Disappearances.</p>  <p>Television credits include The Office, Private Practice, Medium, Parks and Recreation, PBS's Emmy® Award-winning Windy Acres, the Hallmark films Generation Gap and Safe Harbor, as well as Bond of Silence for Lifetime.</p>  <p>Born in West Chester, Pennsylvania, McDermott’s birthdate is April 6.</p>"
  },
  {
    "name": "brick",
    "description": "BRICK / ATICUS SHAFFER",
    "bio": "<p>Atticus Shaffer lives with his mother, Debbie, and father, Ron, along with a small menagerie of pets (all rescues).</p>  <p>He began his professional acting career in late 2006, with a guest-starring role in the comedy series The Class. Other television appearances followed, including The Human Giant, Days of Our Lives, Out of Jimmy's Head, Carpoolers, My Name is Earl and Disney Channel’s Shake It Up.</p>  <p>On the big screen, Shaffer is perhaps best known for the bus stop scene he shared with Will Smith in Hancock. Other feature films include The Unborn, An American Carol, Leaving Barstow and Opposite Day.</p>  <p>Shaffer has given a voice to numerous characters, both on film and TV. He has a starring role in Tim Burton’s animated feature, Frankenweenie, and previously voiced characters in Year One and Subject: I Love You. On television, he is a regular voice on Disney Channel’s animated series Fish Hooks, and previously voiced a recurring part on The Penguins of Madagascar, as well as a guest role on the animated series Thundercats. Shaffer is also very talented with voice impressions and has been incorporating that into some of his recent work.</p>  <p>Shaffer has made numerous talk show appearances, including The Tonight Show with Jay Leno, Conan, The View, Good Morning America and Jimmy Kimmel Live – a fan favorite. He was selected to be a presenter for the 2011 Genesis Awards for his recognition to public awareness of humane treatment of animals, and was invited to be the Grand Marshal of Washington, DC’s 2011 National Cherry Blossom Festival. He was also invited to an internship with Lego Master Builders of Florida, who honored him in spending time learning more about one of his most passionate hobbies.</p>  <p>Shaffer continues to excel in his education and is a major history buff, which he incorporates into directing stop motion animation movies using Legos. He is an avid 'gamer' and especially enjoys video games that include history, Legos or Star Wars.</p>  <p>In addition to all of this are his love for acting and his true passion for comedy. He gives much love and credit to his parents for enabling him to 'be himself' and have the time of his life.</p>"
  },
  {
    "name": "sue",
    "description": "SUE / EDEN SHER",
    "bio": "<p >Eden Sher began singing in her school chorus at the age of eight, which led to acting in school productions. After a small appearance on The Tonight Show, which happened to be filmed at her school, she discovered that performing was indeed her passion and has continued ever since to work in commercials, television, films and on stage. </p>  <p>Sherwas recently nominated for the second year in a row for a Critics Choice Television Award for Best Supporting Actress for her role as Sue Heck.&nbsp; Prior to that, she was best known for her work on the ABC comedy Sons &amp; Daughters. She has also starred in Party Down, ABC Family's The Middleman, Disney's Sonny With A Chance and Showtime's Weeds.</p>  <p>Outside of acting, Sher enjoys yoga, hiking, reading, music and volunteering. She is currently involved with an organization that promotes concerts by local musicians raising funds for various charities. Not only does she devote her time and energy in her local community, she also promotes activism abroad and spends her summers overseas volunteering &#8211; most recently in India at a facility for young children, and earlier, in Nicaragua helping local farmers maintain sustainable agriculture through clean water irrigation. </p>    <p>Her birthdate is on December 26.</p>"    
  }
]